FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ОбменСAudaPadWebТаблицаСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбменСAudaPadWebТаблицаСоответствий</Name>
			<Comment>Обмен с auda pad web таблица соответствий</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование полное</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ОбменСAudaPadWebТаблицаСоответствий/Ext/ManagerModule.bsl
Функция СформироватьТаблицуСоответствийТоваров(Таблица) Экспорт
	
	
	
КонецФункции

Функция СформироватьТаблицуСоответствийРабот(Таблица, Модель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Модель" , Модель);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерРаботы КАК НомерРаботы,
	|	NULL КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаРабот
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.НомерРаботы <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРабот.НомерРаботы,
	|	ЕСТЬNULL(ОбменСAudaPadWebТаблицаСоответствий.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
	|ИЗ
	|	ТаблицаРабот КАК ТаблицаРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбменСAudaPadWebТаблицаСоответствий КАК ОбменСAudaPadWebТаблицаСоответствий
	|		ПО ТаблицаРабот.НомерРаботы = ОбменСAudaPadWebТаблицаСоответствий.Актикул
	|ГДЕ
	|	(ОбменСAudaPadWebТаблицаСоответствий.Модель = &Модель
	|			ИЛИ ОбменСAudaPadWebТаблицаСоответствий.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка))
	|	И ЕСТЬNULL(ОбменСAudaPadWebТаблицаСоответствий.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ССЫЛКА Справочник.Автоработы";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
